CO3 - BPMNs - CODE/CreditService/XML/Adapter/QueryCreditServiceOrderDetailTask_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:task="http://task.creditservice.adapter.orchestrator.josm.tigo.com.hn/" xmlns:v1="http://adapter.josm.tigo.com.hn/RequestType/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <task:executeTask>
         <!--Optional:-->
         <arg0>
            <v1:transactionId>?</v1:transactionId>
            <!--Optional:-->
            <v1:parameters>
               <!--Zero or more repetitions:-->
               <parameter>
                  <name>JSON</name>
                  <value>{
    "QueryCreditServiceOrderDetail": {
      "Account": "1-M67543853",
      "InvoiceId":"4324234"
    }
  }</value>
               </parameter>
            </v1:parameters>
         </arg0>
      </task:executeTask>
   </soapenv:Body>
</soapenv:Envelope>